[Basic Data Exploration](#basic-explor)

[Bivariate analysis](#bivar)

## Course Structure

1. Module 0 - Native Data Types in Python
2. Module 1 - Intro to Pandas library & Basis Dataframe attributes
3. Module 2 - Common Data manipulation tasks using Pandas
4. Module 3 - Loops and Functions 
5. Module 4 - Visualization
6. Module 5 - Other miscellaneous topics

# Jupyter   Refresher
## Jupyter information available at      https://jupyter.org

- Jupyter is an IDE(Integrated  Development Environment)
- Open source application that allows us to create and share documents that contain live code, 
  equations,visualizations, narrative text 
- can be used for data cleaning, transformation,simulation,statistical modelling,data viz,machine learning and more!!!!
- python code written in Jupyter environment has .ipynb extn
  
- Used for coding Python, R scripts ,Scala and packages like numpy,scipy,pandas,matplotlib,seaborn,plotly etc

- note books can be shared with others using email,dropbox,github and the jupyter notebook viewer

- interative output- code can produce html images,videos, etc

- integration with big data tools like apache spar, from python, r and scale.

- explore of data using pandas, scikit learn, ggplot, tensorflow etc


# Jupyter Features

  - Auto indentation 
  - press tab Auto filling
  - Press shift + tab for help/manuals

# Important Key Strokes in Jupyter
    -to add a new cell press alt + enter
    
    -to execute/run a cell press ctrl + enter 
    
    -to delete a cell press esc , then press ctrl + d
    
    -to copy a group of cells and paste in another cell
        go to the particular cell
        press Esc key
        press shift key + use upward or downward arrow keys to select the number of cells
        ctrl + c to copy
        go to a new cell
        PRESS ESC to select the cell   (if you not press escape, all data gets copied in one cell)
        press ctrl + v to paste
    
     - Cell Notations
         - Markdown - allows us to write comments about code without using "#"
         - code  - allows us to write code and run the code
         - rawnbconvert - allows to convert the notebook to another format like html etc
      
     - to create whitespace between 1 cell and another cell
        - change the characteristic of the cell to Markdown                                 
                                      
        - enter 3 dashes in the cell and press alt + enter

---

# MODULE -1  -- Intro to pandas and basic concepts of data frames

DATA INPUT AND OUTPUT USING PANDAS
CSV
EXCEL
HTML
SQL

When you install Jupyter via anaconda distribution, all the below packages come in by defauly

When installing Jupyter outside anaconda distribution, you will need to use the following install commands
Libraries that need to be installed with pip or conda
conda install sqlalchemy
conda install lxml
conda install html5lib
conda install BeautifulSoup4

to read any file, type read_ and click tab

Data frames are 2d data structures .
Data is aligned in a tabular format consists of rows and columns
DataFrames can hold multiple data types
DataFrames Constructor in pandas is
pd.DataFrames(data=,index=,dtype=,copy)
data holds the data source
index holds the index to access the data source
dtype is type of the data
copy is self to false default. take a copy

#############

Pandas deals with the following three data structures −

- Series   : 1D,size-immutable
- DataFrame : 2D, heterogenous, size-mutable
- Panel : 3D size-mutable

In [11]:
#import the pandas library and aliasing as pd
import pandas as pd
import numpy as np

In [12]:
import pandas as pd
import numpy as np
data = np.array(['a','b','c','d'])
s = pd.Series(data)
print (s) # By default idex is assigned from 0 to n

0    a
1    b
2    c
3    d
dtype: object

In [13]:
data = np.array(['a','b','c',1])
s = pd.Series(data,index=[100,101,102,'103'])
print (s)

100    a
101    b
102    c
103    1
dtype: object

In [14]:
s.shape

(4,)

In [15]:
s.get(100)

'a'

In [16]:
s[100]='b'

In [17]:
s.add('e')

100    be
101    be
102    ce
103    1e
dtype: object

In [18]:
s1 = pd.Series([1, 2, 3])
s2 = pd.Series([4, 5, 6])
#s3 = pd.Series([4, 5, 6], index=[3, 4, 5])
s1.append(s2)

0    1
1    2
2    3
0    4
1    5
2    6
dtype: int64

In [19]:
import pandas as pd
import numpy as np
data = {'a' : 0., 'b' : 1., 'c' : 2.}
s = pd.Series(data)
print (s)

a    0.0
b    1.0
c    2.0
dtype: float64

In [20]:
import pandas as pd
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])

#retrieve the first element
print (s[0])

1

In [21]:
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])

#retrieve the first three element
print (s[:3])

a    1
b    2
c    3
dtype: int64

In [22]:
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])

#retrieve the last three element
print (s[-3:])

c    3
d    4
e    5
dtype: int64

A pandas DataFrame can be created using various inputs like −

- Lists
- dict
- Series
- Numpy ndarrays
- Another DataFrame

In [23]:
from numpy.random import randn

In [24]:
np.random.seed(101)      #### we get the same set of random numbers

In [26]:
#### creating a data frame using random number generator randn,use shift + tab to understand more about data frame parameters
df0 = pd.DataFrame(data=randn(5,4),index=['A','B','C','D','E'],columns= ['W','X','Y','Z'])

In [27]:
df0
#### each of the column W,X,Y,Z is each a pandas series sharing a common index

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [28]:
#### creating a data frame from a list
df_list = [['a1','b1','c1'],['a2','b2','c2'],['a3','b3','c3']]
df_list
#### to create user defined index, let us create a list of index
df_index = ['indx1','indx2','indx3']

In [29]:
### create dataframe from list
#data_Frame_list = pd.DataFrame(data=df_list)

data_Frame_list = pd.DataFrame(data=df_list,index=df_index,columns=('ColA','ColB','Colc'))
data_Frame_list

      ColA ColB Colc
indx1   a1   b1   c1
indx2   a2   b2   c2
indx3   a3   b3   c3

In [30]:
#### creating a data frame from a list f tuples
df_list = [('a1','b1','c1'),('a2','b2','c2'),('a3','b3','c3')]
df_list
#### to create user defined index, let us create a tuple of index
df_index = ('indx1','indx2','indx3')

In [31]:
### create dataframe from list
#data_Frame_list = pd.DataFrame(data=df_list)

data_Frame_list = pd.DataFrame(data=df_list,index=df_index,columns=('ColA','ColB','Colc'))
data_Frame_list

      ColA ColB Colc
indx1   a1   b1   c1
indx2   a2   b2   c2
indx3   a3   b3   c3

In [32]:
#### creating a dataframe from dictionary
#### let us create a new diction
df_dict = {'k1':(1,2,3),'k2':(20,30,40),'k3':(30,40,50),'k4':[100,200,300],'k5':[100,200,300]}


### to make INDEXES FOR DATAFRAME
#data_Frame_dict = pd.DataFrame(data=df_dict,index=('I1','I2','I3','I4'),columns=('ColA','ColB','ColC','ColD'))
#data_Frame_dict


### to make INDEXES FOR DATAFRAME
#data_Frame_dict = pd.DataFrame(data=df_dict,index=('k1','k2','k3','k4'),columns=('ColA','ColB','ColC','ColD'))
#data_Frame_dict

In [33]:
### default creation
data_Frame_dict = pd.DataFrame(data=df_dict)
print(data_Frame_dict)

   k1  k2  k3   k4   k5
0   1  20  30  100  100
1   2  30  40  200  200
2   3  40  50  300  300

####### Every column in a data frame is a series by itself
####### series is formed out of numpy arrays

dataframe --> within dataframe there is series ==> within series you have numpy arrays

### Changing data types

In [34]:
temp = pd.DataFrame({"A":["1","2","3"],"B":[11,12,13],"C": ["12-06-2012","13-06-2015","15-06-2017"]})

In [35]:
temp         ### not the keys in dictionary becomes columns and values become rows

   A   B           C
0  1  11  12-06-2012
1  2  12  13-06-2015
2  3  13  15-06-2017

In [36]:
temp.dtypes

A    object
B     int64
C    object
dtype: object

In [37]:
temp["C"] = pd.to_datetime(temp["C"])

In [38]:
temp["A"] = pd.to_numeric(temp["A"])

In [39]:
temp.dtypes

A             int64
B             int64
C    datetime64[ns]
dtype: object

In [40]:
temp["A"] = temp["A"].astype(str)

In [41]:
temp.dtypes

A            object
B             int64
C    datetime64[ns]
dtype: object

In [ ]:
temp["D"] = pd.to_numeric(temp["A"])
temp

In [ ]:
# Creating from dictionary of series
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print (df)

### Creating Data Frames by reading files

In [ ]:
## WE WILL USE THE FILE Uber Drives

In [42]:
## Pandas Libraries to be installed 
import pandas as pd
import numpy as np

In [60]:
# read the data in pandas
df = pd.read_csv("Uber Drives 2016.csv")

In [61]:
df

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit
...,...,...,...,...,...,...,...
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Kar?chi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN

### other ways of reading csv files

### 1
import pandas as pd
df = pd.read_csv('C:\\Users\\anand\\Python-DataScience-Anand\\GL\\march-2930-2019\\Uber Drives 2016.csv')

you can also do an import as below

### 2
from pandas import read_csv
read_csv('C:\\Users\\anand\\Python-DataScience-Anand\\GL\\march-2930-2019\\Uber Drives 2016.csv')

### 3
import pandas as pd
pd.read_csv(r'C:\Users\anand\Python-DataScience-Anand\GL\march-2930-2019\Uber Drives 2016.csv') 

### 4
import pandas as pd
pd.read_csv('C:/Users/anand/Python-DataScience-Anand/GL/march-2930-2019/Uber Drives 2016.csv') 

### 5

import pandas as pd
csv_path = 'C:/Users/anand/Python-DataScience-Anand/GL/march-2930-2019/Uber Drives 2016.csv'i

In [62]:
### renaming column names in dataframe
df.rename(columns={'START_DATE*' : 'start_date',
                    'END_DATE*'  : 'end_date',
                     'CATEGORY*' : 'category',
                     'START*'    : 'start',
                     'STOP*'     : 'stop',
                     'MILES*'    :  'miles',
                     'PURPOSE*'   :  'purpose' }, 
                 inplace=False).head()

,start_date,end_date,category,start,stop,miles,purpose
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit

# Key Modules

1. Basic Dataframe operations
2. Common data manipulation tasks
3. Loops and Functions

## Basic dataframe operations

In [44]:
df.head()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit

In [45]:
### to return a random sample
df2= df.sample(n=100,replace=True)

In [47]:
df2.head(10)

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
950,11/13/2016 8:54,11/13/2016 9:02,Business,Central,Central,2.3,NaN
741,8/30/2016 12:46,8/30/2016 13:09,Business,Unknown Location,Islamabad,8.8,NaN
214,3/11/2016 13:43,3/11/2016 13:51,Business,Red River District,Downtown,1.0,NaN
1021,12/4/2016 20:23,12/4/2016 20:34,Business,Morrisville,Cary,3.4,Customer Visit
239,3/18/2016 8:35,3/18/2016 8:43,Business,Midtown,Midtown,1.1,Meal/Entertain
92,2/11/2016 17:49,2/11/2016 18:10,Business,Eastgate,Walnut Terrace,5.7,Meal/Entertain
907,11/4/2016 22:12,11/4/2016 22:25,Business,Cory,Agnew,3.9,NaN
507,7/3/2016 0:28,7/3/2016 0:38,Business,Cary,Morrisville,3.1,Errand/Supplies
394,6/3/2016 11:29,6/3/2016 11:49,Business,Cary,Durham,10.4,Meeting
419,6/8/2016 16:55,6/8/2016 17:11,Business,Rose Hill,Soho,2.5,Meal/Entertain

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1156 entries, 0 to 1155
Data columns (total 7 columns):
START_DATE*    1156 non-null object
END_DATE*      1155 non-null object
CATEGORY*      1155 non-null object
START*         1155 non-null object
STOP*          1155 non-null object
MILES*         1156 non-null float64
PURPOSE*       653 non-null object
dtypes: float64(1), object(6)
memory usage: 63.3+ KB

In [49]:
### Shape of data frame
df.shape

(1156, 7)

In [ ]:
### size of dataframe # a multiple of rows and columns
df.size

In [ ]:
### datatypes of columns in a dataframe
df.dtypes

In [ ]:
### tells whether object has attribute with given name
print(hasattr(df,"head"))
print(callable(getattr(df,"head")))
print(hasattr(df,"tail"))
print(callable(getattr(df,"tail")))

In [48]:
df.tail()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Kar?chi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN

In [ ]:
df.dtypes

### Dataset summarization methods

In [51]:
df.describe()  ### will give summary statistics for numeric /quantitative variables only

             MILES*
count   1156.000000
mean      21.115398
std      359.299007
min        0.500000
25%        2.900000
50%        6.000000
75%       10.400000
max    12204.700000

In [ ]:
df.describe(include="all")  ### will give summary statistics for all variables - 5 Point Summary

### NaN is missing values
### for quantitative all summary stats are shown
### for categorical only top,freq unique values are shown
### missing values are reported too

##### interpretation of describe
top - gives the top occuring value in a given categorical column  (mode)
freq  gives the frequency of times that a particular value occurs (example here "cary" occurs 201 times as start point
unique = gives the unique occurrence of top occuring value "cary" 177 times

mean - mean value of the column
min - min value of column
std - standard deviation of column
25% - 25th percentile value...meaning 75

In [52]:
### describe for individual columns
df["START_DATE*"].describe()

count                1156
unique               1155
top       6/28/2016 23:34
freq                    2
Name: START_DATE*, dtype: object

In [ ]:
### describe for select group of columns
df[["START_DATE*","END_DATE*"]].describe()

In [53]:
### gives the unique occurrences of each value in a column
df["START*"].value_counts().head(15)

Cary                201
Unknown Location    148
Morrisville          85
Whitebridge          68
Islamabad            57
Durham               37
Lahore               36
Raleigh              28
Kar?chi              27
Apex                 17
Westpark Place       17
Berkeley             16
Midtown              14
Kissimmee            11
Kenner               11
Name: START*, dtype: int64

In [ ]:
# count of unique start locations
df["START*"].value_counts().head()

In [64]:
#Column deletion

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd']), 
   'three' : pd.Series([10,20,30], index=['a','b','c'])}

df = pd.DataFrame(d)
print ("Our dataframe is:")
print (df)

# using del function
print ("Deleting the first column using DEL function:")
del df['one']
print (df)

# using pop function
print ("Deleting another column using POP function:")
df.pop('two')
print (df)

Our dataframe is:
   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN
Deleting the first column using DEL function:
   two  three
a    1   10.0
b    2   20.0
c    3   30.0
d    4    NaN
Deleting another column using POP function:
   three
a   10.0
b   20.0
c   30.0
d    NaN

---

## Common data manipulation tasks

In [65]:
df.head()

   three
a   10.0
b   20.0
c   30.0
d    NaN

In [66]:
### renames columns with the first 3 chars of each column
df.rename(columns=lambda x: x[0:3], inplace=False).head()

    thr
a  10.0
b  20.0
c  30.0
d   NaN

In [67]:
##How To Change and Row Names/Indexes in Pandas?
df.rename(index={0:'zero',1:'one'}, inplace=False).head()

   three
a   10.0
b   20.0
c   30.0
d    NaN

## Common data manipulation tasks
### 2. Select /Indexing

5 verbs of data manipulation

1. Selecting/Indexing
2. Filtering
3. Sorting
4. Mutating/ Conditionally adding columns
5. Groupby/Summarize

In [ ]:
### retreiving /accessing/grabbing/extracting data from a dataframe

In [ ]:
df.head()

In [ ]:
#### to retrieve information from data frame

###
print(type(df))

### extracting top and bottom 5 rows of a column START_DATE* from dataframe df 
print(df['start_date'].head())
print('/n')
print(df['start_date'].tail())
#### note that the output is a series with user defined indexes and also its uni dimensional

In [ ]:
### to verify whether every column in a data frame is a series or not
type(df['start_date'])

In [ ]:
df.head()

In [ ]:
#### To retrieve multiple columns ..note the twin square brackets
df[['start_date','end_date']]

In [ ]:
#### creating a new column  - helps in feature creation
### df['new']   returns error that new column is not found

#### correct way of creating a new column or feature

df['new1']  = df['category'] + df['stop']

##mylistdf = [10000,20000,3000,49999,590000]

##mylistdf

In [ ]:
df.head()

In [ ]:
df.drop('new1',axis=1,inplace=True)

In [ ]:
df.head()

## Indexing and Slicing
Rows can be selected by passing row label to a loc function.

Pandas provide various methods to have purely label based indexing. When slicing, the start bound is also included. Integers are valid labels, but they refer to the label and not the position.

.loc() has multiple access methods like −

- A single scalar label
- A list of labels
- A slice object
- A Boolean array

In [68]:

df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])

In [69]:
df

          A         B         C         D
a  0.041460 -0.411055 -0.771329  0.110477
b -0.804652  0.253548  0.649148  0.358941
c -1.080471  0.902398  0.161781  0.833029
d  0.975720 -0.388239  0.783316 -0.708954
e  0.586847 -1.621348  0.677535  0.026105
f -1.678284  0.333973 -0.532471  2.117727
g  0.197524  2.302987  0.729024 -0.863091
h  0.305632  0.243178  0.864165 -1.560931

In [70]:
#select all rows for a specific column
df.loc['a']

A    0.041460
B   -0.411055
C   -0.771329
D    0.110477
Name: a, dtype: float64

In [71]:
#List of labels
df.loc[['a','b']]

          A         B         C         D
a  0.041460 -0.411055 -0.771329  0.110477
b -0.804652  0.253548  0.649148  0.358941

In [72]:
df.loc['a','A'] # row and column

0.04145994288358152

In [ ]:
#Slice with labels for row and single label for column. 
# note that both the start and stop of the slice are included

In [73]:
df.loc['a':'f':1,('A','B')]

          A         B
a  0.041460 -0.411055
b -0.804652  0.253548
c -1.080471  0.902398
d  0.975720 -0.388239
e  0.586847 -1.621348
f -1.678284  0.333973

In [ ]:
#Conditional that returns a boolean Series

In [74]:
df.loc[df['A']>1]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

iloc[] is primarily integer position based (from 0 to length-1 of the axis), but may also be used with a boolean array.

Allowed inputs are:

-An integer, e.g. 5.

- A list or array of integers, e.g. [4, 3, 0].

- A slice object with ints, e.g. 1:7.

- A boolean array.

- A callable function with one argument (the calling Series or DataFrame) and that returns valid output for indexing (one of the above)

In [75]:
mydict = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},
          {'a': 100, 'b': 200, 'c': 300, 'd': 400},
          {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000 }]
df = pd.DataFrame(mydict)
df

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [76]:
#Using integer value
print(type(df.iloc[0]))
df.iloc[0]

<class 'pandas.core.series.Series'>

a    1
b    2
c    3
d    4
Name: 0, dtype: int64

In [77]:
#With List
df.iloc[[0,1]]

     a    b    c    d
0    1    2    3    4
1  100  200  300  400

In [78]:
#With Slicing
df.iloc[:3]

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [79]:
#With a boolean mask the same length as the index.
df.iloc[[True, False, True]]

      a     b     c     d
0     1     2     3     4
2  1000  2000  3000  4000

With a callable, useful in method chains. The x passed to the lambda is the DataFrame being sliced. This selects the rows whose index label even

In [80]:
df.iloc[lambda x: x.index % 2 == 0]

      a     b     c     d
0     1     2     3     4
2  1000  2000  3000  4000

Indexing both axes

You can mix the indexer types for the index and columns. Use : to select the entire axis.

With scalar integers.

In [81]:
df.iloc[0, 1]

2

In [82]:
df.iloc[[0, 2], [1, 3]]

      b     d
0     2     4
2  2000  4000

In [83]:
#Slicing
df.iloc[1:3, 0:3]

      a     b     c
1   100   200   300
2  1000  2000  3000

In [84]:
df.iloc[:, [True, False, True, False]]

      a     c
0     1     3
1   100   300
2  1000  3000

### Sorting

In [85]:
unsorted_df = pd.DataFrame(np.random.randn(10,2),index=[1,4,6,2,3,5,9,8,0,7],columns = ['col2','col1'])

In [86]:
unsorted_df

       col2      col1
1 -0.251897 -0.578120
4  0.236996  0.200780
6  0.327845  0.674485
2 -0.174057  0.780140
3 -0.383258 -0.409318
5  0.343539  0.196275
9 -0.982776  2.231555
8 -0.971393 -1.522333
0  1.133703  0.528187
7  0.393461 -0.630507

## By label
Using the sort_index() method, by passing the axis arguments and the order of sorting, DataFrame can be sorted. By default, sorting is done on row labels in ascending order.

In [87]:
sorted_df = unsorted_df.sort_index()
sorted_df

       col2      col1
0  1.133703  0.528187
1 -0.251897 -0.578120
2 -0.174057  0.780140
3 -0.383258 -0.409318
4  0.236996  0.200780
5  0.343539  0.196275
6  0.327845  0.674485
7  0.393461 -0.630507
8 -0.971393 -1.522333
9 -0.982776  2.231555

In [88]:
sorted_df = unsorted_df.sort_index(ascending=False)
sorted_df

       col2      col1
9 -0.982776  2.231555
8 -0.971393 -1.522333
7  0.393461 -0.630507
6  0.327845  0.674485
5  0.343539  0.196275
4  0.236996  0.200780
3 -0.383258 -0.409318
2 -0.174057  0.780140
1 -0.251897 -0.578120
0  1.133703  0.528187

By passing the axis argument with a value 0 or 1, the sorting can be done on the column labels. By default, axis=0, sort by row. Let us consider the following example to understand the same.

In [89]:
sorted_df=unsorted_df.sort_index(axis=1)
sorted_df

       col1      col2
1 -0.578120 -0.251897
4  0.200780  0.236996
6  0.674485  0.327845
2  0.780140 -0.174057
3 -0.409318 -0.383258
5  0.196275  0.343539
9  2.231555 -0.982776
8 -1.522333 -0.971393
0  0.528187  1.133703
7 -0.630507  0.393461

# By Value
Like index sorting, sort_values() is the method for sorting by values. It accepts a 'by' argument which will use the column name of the DataFrame with which the values are to be sorted.

In [90]:
unsorted_df = pd.DataFrame({'col1':[2,1,1,1],'col2':[1,3,2,4]})
sorted_df = unsorted_df.sort_values(by='col1')

In [91]:
sorted_df #Observe, col1 values are sorted,the respective col2 value 
          #and row index will alter along with col1. Thus, they look unsorted.

   col1  col2
1     1     3
2     1     2
3     1     4
0     2     1

'by' argument takes a list of column values.

In [92]:
unsorted_df = pd.DataFrame({'col1':[2,1,1,1],'col2':[1,3,2,4]})
sorted_df = unsorted_df.sort_values(by=['col1','col2'])

In [93]:
sorted_df

   col1  col2
2     1     2
1     1     3
3     1     4
0     2     1

Sorting Algorithm

In [94]:
unsorted_df = pd.DataFrame({'col1':[2,1,1,1],'col2':[1,3,2,4]})
sorted_df = unsorted_df.sort_values(by='col1' ,kind='mergesort')

In [95]:
sorted_df

   col1  col2
1     1     3
2     1     2
3     1     4
0     2     1

String operations with basic series

In [96]:
s = pd.Series(['Tom', 'William Rick', 'John', 'Alber@t', np.nan, '1234','SteveSmith'])

In [97]:
s

0             Tom
1    William Rick
2            John
3         Alber@t
4             NaN
5            1234
6      SteveSmith
dtype: object

In [98]:
s.str.lower()

0             tom
1    william rick
2            john
3         alber@t
4             NaN
5            1234
6      stevesmith
dtype: object

In [99]:
s.str.upper()

0             TOM
1    WILLIAM RICK
2            JOHN
3         ALBER@T
4             NaN
5            1234
6      STEVESMITH
dtype: object

In [100]:
s.str.len()

0     3.0
1    12.0
2     4.0
3     7.0
4     NaN
5     4.0
6    10.0
dtype: float64

In [101]:
s.str.get_dummies()

   1234  Alber@t  John  SteveSmith  Tom  William Rick
0     0        0     0           0    1             0
1     0        0     0           0    0             1
2     0        0     1           0    0             0
3     0        1     0           0    0             0
4     0        0     0           0    0             0
5     1        0     0           0    0             0
6     0        0     0           1    0             0

Missing Data

In [103]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f','h'],columns=['one', 'two', 'three'])

In [104]:
df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

In [105]:
df

        one       two     three
a  1.743477  1.130018  0.897796
b       NaN       NaN       NaN
c  0.330866 -1.063049 -0.125381
d       NaN       NaN       NaN
e -0.945588  2.029544 -1.046358
f -1.306482 -1.632924  0.802129
g       NaN       NaN       NaN
h -1.667537  0.608857  0.286473

In [106]:
df['one'].isnull().any()

True

In [107]:
df['one'].notnull()

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

In [108]:
print ("NaN replaced with '0':")
df.fillna(0)

NaN replaced with '0':

        one       two     three
a  1.743477  1.130018  0.897796
b  0.000000  0.000000  0.000000
c  0.330866 -1.063049 -0.125381
d  0.000000  0.000000  0.000000
e -0.945588  2.029544 -1.046358
f -1.306482 -1.632924  0.802129
g  0.000000  0.000000  0.000000
h -1.667537  0.608857  0.286473

In [ ]:
df

In [109]:
df.fillna(method="pad")

        one       two     three
a  1.743477  1.130018  0.897796
b  1.743477  1.130018  0.897796
c  0.330866 -1.063049 -0.125381
d  0.330866 -1.063049 -0.125381
e -0.945588  2.029544 -1.046358
f -1.306482 -1.632924  0.802129
g -1.306482 -1.632924  0.802129
h -1.667537  0.608857  0.286473

In [110]:
df.fillna(df.median())

        one       two     three
a  1.743477  1.130018  0.897796
b -0.945588  0.608857  0.286473
c  0.330866 -1.063049 -0.125381
d -0.945588  0.608857  0.286473
e -0.945588  2.029544 -1.046358
f -1.306482 -1.632924  0.802129
g -0.945588  0.608857  0.286473
h -1.667537  0.608857  0.286473

In [111]:
df.dropna()

        one       two     three
a  1.743477  1.130018  0.897796
c  0.330866 -1.063049 -0.125381
e -0.945588  2.029544 -1.046358
f -1.306482 -1.632924  0.802129
h -1.667537  0.608857  0.286473

In [ ]:
df

In [114]:
df.dropna(axis=1,inplace=True)

In [115]:
df

Empty DataFrame
Columns: []
Index: [a, b, c, d, e, f, g, h]

## Split Data into Groups
Pandas object can be split into any of their objects. There are multiple ways to split an object like −

obj.groupby('key')
obj.groupby(['key1','key2'])
obj.groupby(key,axis=1)

In [116]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}

In [117]:
df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [118]:
print(df.groupby('Team')) # by label

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002A563FC1C88>

In [119]:
df.groupby('Team').groups

{'Devils': Int64Index([2, 3], dtype='int64'),
 'Kings': Int64Index([4, 6, 7], dtype='int64'),
 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'),
 'Royals': Int64Index([9, 10], dtype='int64'),
 'kings': Int64Index([5], dtype='int64')}

In [120]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)

df.groupby(['Team','Year']).groups # by multiple columns

{('Devils', 2014): Int64Index([2], dtype='int64'),
 ('Devils', 2015): Int64Index([3], dtype='int64'),
 ('Kings', 2014): Int64Index([4], dtype='int64'),
 ('Kings', 2016): Int64Index([6], dtype='int64'),
 ('Kings', 2017): Int64Index([7], dtype='int64'),
 ('Riders', 2014): Int64Index([0], dtype='int64'),
 ('Riders', 2015): Int64Index([1], dtype='int64'),
 ('Riders', 2016): Int64Index([8], dtype='int64'),
 ('Riders', 2017): Int64Index([11], dtype='int64'),
 ('Royals', 2014): Int64Index([9], dtype='int64'),
 ('Royals', 2015): Int64Index([10], dtype='int64'),
 ('kings', 2015): Int64Index([5], dtype='int64')}

Iterating through Groups
With the groupby object in hand, we can iterate through the object similar to itertools.ob

In [121]:
grouped = df.groupby('Year')

for year,group in grouped:
    print (year)
    print (group)

2014
     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701
2015
      Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    kings     4  2015     812
10  Royals     1  2015     804
2016
     Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694
2017
      Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     690

In [122]:
grouped.get_group(2014)

     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701

Merge Two Dataframes on a key

In [123]:
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})

In [124]:
left

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5

In [129]:
right = pd.DataFrame({'id':[1,2,3,4,5],'Name': ['Billy', 'Brian', 'Bran','Bryce', 'Betty'],'subject_id':['sub2','sub4','sub3','sub6','sub5']})

In [130]:
right

   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [131]:
pd.merge(left,right,on='id')

   id  Name_x subject_id_x Name_y subject_id_y
0   1    Alex         sub1  Billy         sub2
1   2     Amy         sub2  Brian         sub4
2   3   Allen         sub4   Bran         sub3
3   4   Alice         sub6  Bryce         sub6
4   5  Ayoung         sub5  Betty         sub5

Merge Two DataFrames on Multiple Keys

In [132]:
pd.merge(left,right,on=['id','subject_id'])

   id  Name_x subject_id Name_y
0   4   Alice       sub6  Bryce
1   5  Ayoung       sub5  Betty

Left Join

In [133]:
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})

In [134]:
left

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5

In [135]:
right = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5']})

In [136]:
right

   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [137]:
pd.merge(left, right, on='subject_id', how='left')

   id_x  Name_x subject_id  id_y Name_y
0     1    Alex       sub1   NaN    NaN
1     2     Amy       sub2   1.0  Billy
2     3   Allen       sub4   2.0  Brian
3     4   Alice       sub6   4.0  Bryce
4     5  Ayoung       sub5   5.0  Betty

In [138]:
pd.merge(left, right, on='subject_id', how='right')

   id_x  Name_x subject_id  id_y Name_y
0   2.0     Amy       sub2     1  Billy
1   3.0   Allen       sub4     2  Brian
2   4.0   Alice       sub6     4  Bryce
3   5.0  Ayoung       sub5     5  Betty
4   NaN     NaN       sub3     3   Bran

In [139]:
pd.merge(left, right, how='outer', on='subject_id')

   id_x  Name_x subject_id  id_y Name_y
0   1.0    Alex       sub1   NaN    NaN
1   2.0     Amy       sub2   1.0  Billy
2   3.0   Allen       sub4   2.0  Brian
3   4.0   Alice       sub6   4.0  Bryce
4   5.0  Ayoung       sub5   5.0  Betty
5   NaN     NaN       sub3   3.0   Bran

Inner Join
Joining will be performed on index. Join operation honors the object on which it is called. 
So, a.join(b) is not equal to b.join(a).

In [140]:
pd.merge(left, right, on='subject_id', how='inner')

   id_x  Name_x subject_id  id_y Name_y
0     2     Amy       sub2     1  Billy
1     3   Allen       sub4     2  Brian
2     4   Alice       sub6     4  Bryce
3     5  Ayoung       sub5     5  Betty

Descriptive Statitics

In [141]:
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}

#Create a DataFrame
df = pd.DataFrame(d)

In [142]:
df

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

In [143]:
df.sum()

Name      TomJamesRickyVinSteveSmithJackLeeDavidGasperBe...
Age                                                     382
Rating                                                44.92
dtype: object

Each individual column is added individually (Strings are appended).
axis=1
This syntax will give the output as shown below

In [144]:
df.sum(1)

0     29.23
1     29.24
2     28.98
3     25.56
4     33.20
5     33.60
6     26.80
7     37.78
8     42.98
9     34.80
10    55.10
11    49.65
dtype: float64

In [145]:
df.mean()

Age       31.833333
Rating     3.743333
dtype: float64

In [146]:
df.std()

Age       9.232682
Rating    0.661628
dtype: float64

In [147]:
df.to_csv("iplcsv.csv")

In [149]:
df.describe()

             Age     Rating
count  12.000000  12.000000
mean   31.833333   3.743333
std     9.232682   0.661628
min    23.000000   2.560000
25%    25.000000   3.230000
50%    29.500000   3.790000
75%    35.500000   4.132500
max    51.000000   4.800000

In [ ]:
pd.read_sql_query()